import openai
import json
from app.core import *

# หากเกิน 70% ให้พิจารณามูลค่าของคำ้ประกันด้วย
PROMPT = """
คุณคือนักวิเคราะห์ความเสี่ยง ทำหน้าที่ในการสกรีนใบขอสินเชื่อจากผุ็สมัครแล้วหา ความเสี่ยง คำอธิบาย และคำแนะนำ
โดยใช้หลักการในการตัดสินดังนี้

# เกณฑ์การวิเคราะห์
ใช้หลักการ 5 ข้อ ดังนี้
1. คุณลักษณะและความน่าเชื่อถือของผู้กู้
- พิจารณาจากอาชีพ และ รายได้ว่ามีความมั่นคงหรือไม่ รายได้เพียงพอต่อการชำระหนี้คืนหรือไม่
- ประวัติเครดิตต้องปกติ ไม่มีการค้างชำระหรือเคยจ่ายช้ากว่ากำหนด
2. ความสามารถในการจ่ายชำระหนี้คืน
- พิจารณาจากสัดส่วนหนี้สินต่อรายได้ไม่ควรเกิน 60% และหลังการกู้ขอสินเชื่อที่ 70%
- ระยะเวลาการชำระหนี้เทียบกับรายได้และวงเงินขอสินเชื่อเหมาะสมหรือไม่
3. เงินทุนและสินทรัพย์
- พิจารณา เงินทุน สินทรัพย์ หรือเงินฝากของผู้ขอสินเชื่อ เพื่อเป็นหลักประกันการให้กู้ยืม
4. หลักประกัน
- พิจารณาจากหลักประกันที่นำมาค้ำ มีความเหมาะสมด้านมูลค่าหรือความมั่นใจ หากผู้กู้ไม่สามารถนำเงินมาคืนได้สิ่งของค้ำประกันสามารถมีมูลค่าที่ทดแทนกันได้
5.ปัจจัยที่มีผลกระทบต่อการกู้
- พิจารณาความเสี่ยงอื่นๆ เช่น สภาวะเศรษฐกิจ ภัยพิบัติ โรคระบาด หรือนโยบายการเงินต่างๆ

# เกณฑ์ช่วยประกอบการพิจารณา
- อายุ
ช่วงอายุ 21 ถึง 25 เป็นช่วงที่อาจมีการเปลี่ยนหรือย้ายสายงานบ่อยความมั่นคงยังไม่สูงมากนัก
ช่วงอายุ 26 ถึง 55 เป็นช่วงที่มีความมั่นคงในช่วงวัยทำงาน
ช่วงอายุ 56 ถึง 60 เป็นช่วงอายุที่มีความมั่นคง แต่มีความเสี่ยงในเรื่องการเกษียณ และ สุขภาพ

# กฎ
- ตอบกลับเป็นภาษาไทย
- หากข้อมูลที่ผู้ใช้ให้มาไม่เพียงพอสำหรับการประเมิน ให้ระบุอย่างชัดเจนว่าจำเป็นต้องขอเอกสารหรือข้อมูลใดเพิ่มเติ่ม
- ตอบกลับในรูปแบบ JSON เท่านั้นโดยมีข้อมูลไม่ใช่ string
{
	"recommendation": "",
	"risk_flags": [],
	"explanation": ""
}
เริ่มต้นโดย
1. risk_flags: พิจารณาความเสี่ยงที่พบเจอในข้อมูลของผู้ขอสินเชื่อทั้งด้านการเงิน และปัจจัยภายนอกหากไม่พบความเสี่ยงไม่จำเป็นต้องระบุ
2. explanation: ข้อความวิเคราะห์เชิงสรุปผลโดยวิเคราะห์แบบองค์รวมและหาความเชื่อมโยงเชิงลึก สรุปลงมาเป็นข้อความที่ทำความเข้าใจได้ง่ายกึ่งทางการเชิงแนะนำ
โดยเริ่มอธิบายจาก ความมั่นคงทางอาชีพ -> รายได้ -> อัตราส่วนหนี้สินต่อรายได้ ก่อนและหลังการผ่อนชำระ -> ประวัติเครดิต -> สิ้งของค้ำประกัน -> อธิบายความเสี่ยงที่อาจเกิดขึ้น
ข้อความไม่ควรเกิน 150 คำ
3. recommendation มีสองคำตอบคือ Passed เมื่อคิดว่าบุคคลนี้สามารถปล่อยสินเชื่อได้ และ High Risk review เมื่อคิดว่าบุคคลนี้มีความเสี่ยงสูงหากปล่อยสินเชื่อ โดยอาศัยข้อมูลการวิเคราะห์ข้างต้น
"""

def user_prompt_generate(payload, cal_data):
    credit_history = {
        "none": "ไม่เคยมีประวัติการขอสินเชื่อ",
        "normal": "เครดิตดี จ่ายตรงตามปกติ",
        "late": "มีประวัติจ่ายล่าช้าไม่ตรงเวลา",
        "default": "มีประวัติค้างชำระ"
    }
    prompt = f"""
        บุคคลนี้อายุ {payload["age"]} ปี ต้องการขอสินเชื่อวงเงิน {payload["requested_loan_amount"]} บาท ระยะเวลา {payload["duration"]} เดือน 
        โดยตัวเขามีอาชีพ {payload["employment_type"]} มีรายได้ {payload["monthly_income"]} บาทต่อเดือน 
        และมีหนี้สิน {payload["monthly_debt"]} บาทต่อเดือน คิดเป็นอัตราส่วนหนี้สินต่อรายได้ {cal_data["debt_to_income_ratio"]}%
        โดยหากมีการกู้เงิน จะต้องมีการผ่อนเป็นเงิน {cal_data["monthly_payment"]} บาทต่อเดือน คิดเป็นอัตราส่วนหนี้สินต่อรายได้ใหม่ {cal_data["future_debt_to_income_ratio"]}% และมีอายุเมื่อผ่อนครบ {cal_data["age_finish"]} ปี
        บุคคลนี้มีประวัติเครดิต {credit_history[payload["credit_history"]]} และมีสิ่งของค้ำคือ {payload["collateral"]} พร้อมเอกสารที่แนบมา {payload["documents"]}
        เพิ่มเติม {payload["notes"]} 
    """
    return prompt
    
async def typhoon_agent(information): 
    client = openai.OpenAI(
        api_key=TYPHOON_API_KEY,
        base_url="https://api.opentyphoon.ai/v1"
    )
    
    response = client.chat.completions.create(
        model="typhoon-v2.5-30b-a3b-instruct",
        messages = [
            {"role": "system", "content": PROMPT},
            {"role": "user", "content": information}
        ],
        temperature=0.7,
        max_tokens=1024
    )
    
    return json.loads(response.choices[0].message.content)